/**
 * @Author
 * @date 2023/2/1 20:17
 */
public class Stars {
    public static void main(String args[]){
        /*

             *
           *  *
          *    *
         ********
         */


        /*
        1.先打印个矩形

        ********
        ********
        ********
        ********
        ********

        2.打印半个金字塔
        *       // 第1行1个*
        **      // 第2行2个*
        ***     // 第3行3个*
        ****    // 第4行4个*
        *****   // 第5行5个*

        3.打印整个金字塔
            *
           ***
          *****
         *******
        *********

        4.打印空心金字塔
            *
           * *
          *   *
         *     *
        *********
         */
        for (int i=0; i < 5; i++){
            for (int j=0; j<i; j++){
                System.out.print('*');
            }
            System.out.print('\n');
        }

    }
}
